[
  {
    "role": "Full-stack Engineer ",
    "company": "Tranq-bay-Health, Berlin, Germany ",
    "duration": "Oct. 2023 - Present",
    "description": "Actively contributed to the adoption of best practices in front-end development, including code reviews, testing, and documentation.  Implementing Jest for unit testing and Cypress for end-to-end testing, ensuring the robustness and reliability of the application. Participating in the planning and design meetings to contribute to the development process of the web application.  Leveraged proficiency in TailWind CSS and NextJS to create dynamic and interactive web solutions. Integrated Redux, a powerful state management tool, to optimise the management of application state and enhance user experiences. Utilised my expertise in Nest.js and TypeORM to craft dynamic and interactive back-end solutions within micro services architecture.Impslemented event-driven services to enhance system responsiveness and scalability, ensuring the efficient operation of the backend infrastructure."
  },
  {
    "role": "Frontend Developer",
    "company": "Cyberbuddies, Nigeria   ",
    "duration": "Jan. 2023 - July. 2023",
    "description": "Actively contributed to the adoption of best practices in front-end development, including code reviews, testing, and documentation. Participating in the planning and design meetings to contribute to the development process of web applications, including World Xplorer and Havens Project. Leveraged proficiency in HTML, CSS, JavaScript, and ReactJS to create dynamic and interactive web solutions. "
  },
  {
    "role": "Junior Software Enginner",
    "company": "SQI College of ICT, Nigeria  ",
    "duration": "Jan. 2022 - Dec. 2022",
    "description": "Learning new technologies and programming languages as needed. Participating in the planning and design meetings to contribute to the development process of web applications. Providing learning support to students of the ongoing software engineering cohort.  "
  },
  {
    "role": "Front-end Engineer (Intern) ",
    "company": "BOW Dynamics ",
    "duration": "Jan. 2020 - Nov. 2021",
    "description": "Participated in the planning and design meetings to contribute to the development process of web applications. Analysed UI/UX designs, turned design pages and specific components into HTML, CSS, and JavaScript.  "
  }
]
